{
    "tweet_1": {
        "text": "If you reserved a #Tesla Founders Series Roadster when they were first announced on Nov 17th, 2017 for $250k that same $250k invested in $TSLA would be 3,967.62 shares ($63.01 on Nov 17th 2017). Those shares would be worth $2,756,623.02 as of today's $TSLA close at $694.78.",
        "likes": 584,
        "replies": 38,
        "retweets": 61
    },
    "tweet_2": {
        "text": "So @BeartikalRBLX and I have finally decided to end the year off by getting our dream car, a 2021 Tesla Model 3! Thank you so much to @Roblox @robloxdevrel for making this possible.Here's to the years ahead! #Roblox #Tesla",
        "likes": 407,
        "replies": 49,
        "retweets": 18
    },
    "tweet_3": {
        "text": " The G-BOX Era is live! C؜­­la؜­­­i؜m your G-BOX now.Each G-BOX contains one of three r­e؜­­w؜­­؜a؜­­r­؜d؜؜؜؜­­sDon't miss out, supp؜؜؜؜؜؜؜ly is li­؜m؜؜؜i­te­؜d",
        "likes": 220,
        "replies": 0,
        "retweets": 18
    },
    "tweet_4": {
        "text": "Tesla Model Y is currently only being manufactured out of one facility. By this time next year it will be manufactured out of 4 facilities.  $TSLA",
        "likes": 675,
        "replies": 11,
        "retweets": 36
    },
    "tweet_5": {
        "text": "Sooo! My sister took delivery of her #M3 today. She was told that the Trial FSD would not start until the middle of January. Why would @Tesla wait? Unless it is an official 1.0 release of FSD and not just EAP? @greentheonly",
        "likes": 566,
        "replies": 25,
        "retweets": 28
    },
    "tweet_6": {
        "text": "What, no marshmallows!? Jk Thanks @Tesla!",
        "likes": 90,
        "replies": 5,
        "retweets": 2
    },
    "tweet_7": {
        "text": "New York : homelessness, unemployment out the ass, housing crisis, poor and struggling college students, restaurant + small business closures.New York Government: yo NYPD, y’all want some Tesla’s ??????",
        "likes": 79,
        "replies": 0,
        "retweets": 17
    },
    "tweet_8": {
        "text": "They did it!",
        "likes": 167,
        "replies": 0,
        "retweets": 4
    },
    "tweet_9": {
        "text": "I am never buying a Tesla, a Patagonia vest, or a vape pen because if I do this cartoon will decease me ",
        "likes": 144,
        "replies": 22,
        "retweets": 8
    },
    "tweet_10": {
        "text": "This car costs 1.3 #bitcoin#tesla",
        "likes": 15,
        "replies": 6,
        "retweets": 0
    },
    "tweet_11": {
        "text": "Number of Teslas registered in Norway today was 313 with 2 Model S, 3 Model X and 308 Model 3 making it a total of 58239 Source:  #Tesla #Norway $TSLA",
        "likes": 23,
        "replies": 0,
        "retweets": 2
    },
    "tweet_12": {
        "text": "So Earldomish of you ~",
        "likes": 17,
        "replies": 1,
        "retweets": 2
    },
    "tweet_13": {
        "text": "Thanks tesla. With the way the pandemic has hit the economy so hard, you've helped me right from the start. Originally, goal was to be up by 10% and be grateful. Instead, you've got me up by almost 50% in a very short matter of time.Let's go 700+ & beyond!",
        "likes": 9,
        "replies": 2,
        "retweets": 1
    },
    "tweet_14": {
        "text": "There was a Porsche and Tesla racing on the expressway right now & my man really had me chasing them in my weak ass car to see who’d win lmfao",
        "likes": 22,
        "replies": 1,
        "retweets": 0
    },
    "tweet_15": {
        "text": "Want to get better at Starcraft?Here's some SpeCial advice!Industry professionals hate him for letting out this secret! Try it out now and see your MMR rocket up like Tesla stocks!By: Professor @SpeCial_SC2",
        "likes": 177,
        "replies": 6,
        "retweets": 19
    },
    "tweet_16": {
        "text": "Tesla Driver Charged With Dangerous Driving For Speeding While Sleeping ",
        "likes": 12,
        "replies": 4,
        "retweets": 3
    },
    "tweet_17": {
        "text": "Im a simple man. I’m just tryna have a 3000 sqft home and a Tesla.",
        "likes": 4,
        "replies": 0,
        "retweets": 2
    },
    "tweet_18": {
        "text": "i’m sorry but why are police getting brand new tesla’s when schools around the country don’t have updated textbooks or resources to start music programs or countless other things...",
        "likes": 11,
        "replies": 0,
        "retweets": 2
    },
    "tweet_19": {
        "text": "Good Morning Shanghai and Tesla Fam it’s the last day of the year. Not far from 7000 Followers on Twitter it’s an amazing experience so far. It’s been a pleasure to meet and talk to you all. #Tesla #TeslaChina #Model3 #ShanghaiTower #特斯拉 #中国 $TSLA",
        "likes": 45,
        "replies": 1,
        "retweets": 0
    },
    "tweet_20": {
        "text": "My fun Wednesday day off was venturing Eastern Colorado in my Tesla on pretty much autopilot.  Always nice way to clear the head. #Tesla #Model3 #Colorado",
        "likes": 15,
        "replies": 4,
        "retweets": 1
    },
    "tweet_21": {
        "text": "Does the Elon/Tesla fan club have a name? Cuz I’m proposing musk rats.",
        "likes": 9,
        "replies": 2,
        "retweets": 0
    },
    "tweet_22": {
        "text": "If Tesla didn't exist, what company(s) would you be investing in? @vincent13031925 @jasondebolt @stevenmarkryan @heydave7 @HyperChangeTV @AlternateJones @garyblack00 @Real_Futurist @GerberKawasaki @ParikPatelCFA @ICannot_Enough @MatchasmMatt @JosephVVallace @jeremyjudkins",
        "likes": 14,
        "replies": 17,
        "retweets": 1
    },
    "tweet_23": {
        "text": "Prime members have access to a lot of great deals, but some of the best ones are hidden. Here's how to find them.",
        "likes": 627,
        "replies": 396,
        "retweets": 134
    },
    "tweet_24": {
        "text": "This is pure clown shit. No cop needs a damn Tesla ",
        "likes": 78,
        "replies": 5,
        "retweets": 4
    },
    "tweet_25": {
        "text": "Cathie Wood & @ARKInvest trade activity from today 12/30Bought: $KSPI $TCS Novartis $NVS Roche $RHHBY Repare $RPTX Takeda $TAK Nintendo $NTDOY Baidu $BIDUSold: Tesla $TSLA Taiwan Semi $TSM Exone $XONE Twilio $TWLO",
        "likes": 71,
        "replies": 12,
        "retweets": 10
    },
    "tweet_26": {
        "text": "Bikers:What cars make the scariest drivers? Here's my ranking1. Dodge Charger2. White guy in a BMW/Audi3. Lifted pickup truck4. Middle-aged lady in a Prius5. Police cruiser6. Fedex truck7. Amazon delivery van8. ",
        "likes": 79,
        "replies": 28,
        "retweets": 5
    },
    "tweet_27": {
        "text": "Alright so who's the next Dev to buy a Tesla, don't let the trend stop! ",
        "likes": 48,
        "replies": 10,
        "retweets": 0
    },
    "tweet_28": {
        "text": "Reach an international audience through our open access publication model. We have calls for papers in your subject area.",
        "likes": 129,
        "replies": 15,
        "retweets": 34
    },
    "tweet_29": {
        "text": "I truly cannot find any logical reason as to why a police dept would need a Tesla...???? Tf",
        "likes": 3,
        "replies": 0,
        "retweets": 1
    },
    "tweet_30": {
        "text": "What are the best sounds you’ve seen or want to see for Tesla Boombox?",
        "likes": 22,
        "replies": 16,
        "retweets": 1
    },
    "tweet_31": {
        "text": "Grayscale, MicroStrategy and Tesla are tying to buy btc, but there is not much at sale. Once their purchase goes through, ati ni problem ",
        "likes": 11,
        "replies": 1,
        "retweets": 3
    },
    "tweet_32": {
        "text": "my boss stopped me from getting hit by a tesla and i’ve never been so angry in my life",
        "likes": 8,
        "replies": 0,
        "retweets": 0
    },
    "tweet_33": {
        "text": "Coral AI is one of the best new AI tools for research. Just upload a PDF file, ask a question, and get an answer in seconds. It's like ChatGPT, but built for researchers. Try it for free.",
        "likes": 1700,
        "replies": 0,
        "retweets": 295
    },
    "tweet_34": {
        "text": "Tesla Geeks Show Feat. Trevor of Tesla Owners Online!",
        "likes": 27,
        "replies": 3,
        "retweets": 3
    },
    "tweet_35": {
        "text": "i’ve been here two days, and nichole has almost hit a tesla and a bentley",
        "likes": 10,
        "replies": 0,
        "retweets": 0
    },
    "tweet_36": {
        "text": "NAHHHH I JUST TOOK A PICTURE WITH FLASH AND THERE WAS AN ORB ITS NICOLA TESLA",
        "likes": 5,
        "replies": 0,
        "retweets": 0
    },
    "tweet_37": {
        "text": "Hey Siri, bring the car aroundTesla will be facing some major competition from Apple in the EV market in a few years' time as Project Titan seems to be moving forward. TSLA investors beware!",
        "likes": 2,
        "replies": 0,
        "retweets": 2
    },
    "tweet_38": {
        "text": ".@RiskReversal says he’s never seen a frenzy like Tesla’s rally this year. He breaks down the rising trend and warns investors to not get too excited. $TSLA",
        "likes": 58,
        "replies": 20,
        "retweets": 9
    },
    "tweet_39": {
        "text": "Need to clear snow  off your driveway? Tesla Model Y will handle this without any problems @elonmusk ",
        "likes": 16,
        "replies": 1,
        "retweets": 2
    },
    "tweet_40": {
        "text": "if i get pulled over by a tesla there will be hell to pay ",
        "likes": 10,
        "replies": 0,
        "retweets": 0
    },
    "tweet_41": {
        "text": "I wanna create an app when the Tesla App Store is releasedI just have no idea what app would be cool to have in Teslas ",
        "likes": 6,
        "replies": 5,
        "retweets": 0
    },
    "tweet_42": {
        "text": "How much longer do I have to pretend that the BMW driver stereotype hasn’t been replaced by Tesla drivers",
        "likes": 5,
        "replies": 0,
        "retweets": 0
    },
    "tweet_43": {
        "text": "\"Let the future tell the truth, and evaluate each one according to his work and accomplishments. The present is theirs; the future, for which I have really worked, is mine.\" ~ Nikola Tesla",
        "likes": 7,
        "replies": 0,
        "retweets": 1
    },
    "tweet_44": {
        "text": "All I can say is \" Tesla is real.\"",
        "likes": 35,
        "replies": 2,
        "retweets": 3
    },
    "tweet_45": {
        "text": "no one cares but in my dream justin bieber drove me around new york in a tesla",
        "likes": 3,
        "replies": 1,
        "retweets": 0
    },
    "tweet_46": {
        "text": "Experience Nohgaku in the Metaverse!The exhibition space will be open for a limited time only, utilizing the Metaverse (virtual space service) to “make you want to see NOHGAKU and come to Japan”.Metaverse open dates: 2024/1/10 - 2024/3/22#NOHGAKU #NOH #metaverse",
        "likes": 7400,
        "replies": 464,
        "retweets": 354
    },
    "tweet_47": {
        "text": "Just saw a Tesla with “KIDMD” and first thing I thought was, “Hmm, you think Doogie Howser lives in OKC?” @ActuallyNPH Took me a minute to realize it was probably a pediatrician.",
        "likes": 7,
        "replies": 0,
        "retweets": 0
    },
    "tweet_48": {
        "text": "Sorry TJ, all he's asking is for you to back up a controversial point you brought up. Its too big for TwitterThe gist is that like Tesla/Edison we had Pasteur/Bechamp: On Spanish Flu read The Invisible Rainbow or this ok summary: ",
        "likes": 6,
        "replies": 1,
        "retweets": 0
    },
    "tweet_49": {
        "text": "Siri, could you drive me to the airport? According to a recent @Reuters report, @apple expects to have a self-driving car ready by 2024! Read our article to learn more!   #innotechtoday #electriccar #Apple #appletech #applecar #tesla #teslamodels",
        "likes": 3,
        "replies": 0,
        "retweets": 2
    },
    "tweet_50": {
        "text": "#Tesla factory being built in Gruenheide 30km south-east of #Berlin is expected to go online next summer ",
        "likes": 26,
        "replies": 2,
        "retweets": 13
    },
    "tweet_51": {
        "text": "The 50CAL Speaker320Watts up to 78hr battery340ft Bluetooth rangeGuitar inputUSB C+A charge ports to charge your devices in the wild100+ reviews scoring ★★★★★Shop now: #AmmoCanSpeaker #bluetoothspeaker #outdoors #adventure #tacticool",
        "likes": 195,
        "replies": 25,
        "retweets": 34
    },
    "tweet_52": {
        "text": "I'm watching Goldfinger right now (James Bond flick from 1965). Villain plans to detonate a dirty nuke inside Fort Knox so the value of his Gold goes up 10x.1. He could have just waited 15 years for a 25x increaseOR2. Bought Tesla in 2020 for the same 10x increase",
        "likes": 5,
        "replies": 1,
        "retweets": 0
    },
    "tweet_53": {
        "text": "Can somebody send me a link to the tesla truck",
        "likes": 17,
        "replies": 1,
        "retweets": 1
    },
    "tweet_54": {
        "text": "Let's all congratulate @TeslaPodcast on his very first Tesla: a 2021 red Model 3 I think you're going to get along splendidly.",
        "likes": 55,
        "replies": 1,
        "retweets": 4
    },
    "tweet_55": {
        "text": "All's well that ends well. With only 2 days to go, #Tesla could beat its 2018 self in The Netherlands. They have a shot for the same in Norway tomorrow.(for US bros: Tesla hasn't sold M3 in 2018 in Europe, it was all SuX)$TSLA $TSLAQ",
        "likes": 16,
        "replies": 2,
        "retweets": 1
    },
    "tweet_56": {
        "text": "ChatGPT is always making up information.Use this AI tool instead.Coral AI always gives you accurate answers, pulled directly from the source.It also gives you a page citation with every answer, so you can verify it.Try it for free.",
        "likes": 23,
        "replies": 0,
        "retweets": 5
    },
    "tweet_57": {
        "text": "I already have it. Thanks.",
        "likes": 17,
        "replies": 6,
        "retweets": 0
    },
    "tweet_58": {
        "text": "OH ok",
        "likes": 8,
        "replies": 2,
        "retweets": 0
    },
    "tweet_59": {
        "text": "Tesla is now worth more than Toyota and Japan's six other major car manufacturers combined. That's despite the fact that Tesla sold about 367,500 vehicles, or 3.4 percent of Toyota's output of 10.74 million units, last year.A lot of people will get their finger burned....",
        "likes": 9,
        "replies": 1,
        "retweets": 3
    },
    "tweet_60": {
        "text": "This is one of my favorite ones of 2020 showing the fun I had before taking this picture @TeslaClubNorway event ",
        "likes": 8,
        "replies": 2,
        "retweets": 0
    },
    "tweet_61": {
        "text": "No, I don't have a Founders Series Roadster reservation but I was bored on a Wednesday afternoon. cc Tesla peeps @SawyerMerritt @vincent13031925 @heydave7 @EmmetPeppers @ValueAnalyst1 @garyblack00 @slye @ChrisDungeon @truth_tesla @FrankPeelen @freshjiva @jpr007 @ICannot_Enough",
        "likes": 32,
        "replies": 2,
        "retweets": 0
    },
    "tweet_62": {
        "text": "Based on Tesla labeling Model Y Shanghai as construction, which will start deliveries in January/February. It leads me to believe that Texas will start to deliver Model Y before Cybertruck.",
        "likes": 10,
        "replies": 0,
        "retweets": 2
    },
    "tweet_63": {
        "text": "Y’all are really more mad that people wanna reallocate police resources than u are that police forces are literally spending their money to buy themselves Tesla’s LOL. Are y’all ok ??????????",
        "likes": 7,
        "replies": 0,
        "retweets": 0
    },
    "tweet_64": {
        "text": "JAILBREAK THE TESLA",
        "likes": 5,
        "replies": 0,
        "retweets": 1
    },
    "tweet_65": {
        "text": "$AVZ The Goat is back +80% for the last week of the year.Couldn't be happier for long term holders and Believers.$CXO will also be heading to the high teens with there indirect links to supplying Tesla through the Tesla/Yahua 5 year deal..Yahua are also CXO largest holder",
        "likes": 21,
        "replies": 0,
        "retweets": 4
    },
    "tweet_66": {
        "text": "But they can’t get the American people 2K but they can get the pigs a Tesla with our tax money.... makes sense",
        "likes": 20,
        "replies": 0,
        "retweets": 1
    },
    "tweet_67": {
        "text": " if you don’t have to be present?",
        "likes": 24,
        "replies": 0,
        "retweets": 0
    },
    "tweet_68": {
        "text": "Tesla will cancel all service appointments regarding the Pedestrian Warning Speaker at this time! Please wait for a later date!",
        "likes": 4,
        "replies": 1,
        "retweets": 0
    },
    "tweet_69": {
        "text": "Bare Metal Server Sale",
        "likes": 85000,
        "replies": 6400,
        "retweets": 6400
    },
    "tweet_70": {
        "text": "Okay and the only people He inconvenienced were filthy authorities who lie everyday and get a tesla and nobody gaf about them so boohoo",
        "likes": 15,
        "replies": 2,
        "retweets": 0
    },
    "tweet_71": {
        "text": "Quite a thread from this member of the National Transportation Safety Board. She's clearly had it with Tesla, and also with @NHTSAgov.She has every right to be pissed. NTSB has been sounding every alarm it can about Autopilot and Full-Self Driving.",
        "likes": 31,
        "replies": 2,
        "retweets": 2
    },
    "tweet_72": {
        "text": "I disagree! Tesla still has a low bagholder to bullshit ratio. It’s hasn’t conned enough investors yet.$TSLA $TSLAQ",
        "likes": 15,
        "replies": 6,
        "retweets": 7
    },
    "tweet_73": {
        "text": "Tesla Drivers Can Now Use A Fart Noise As A Horn ",
        "likes": 8,
        "replies": 1,
        "retweets": 6
    },
    "tweet_74": {
        "text": "Say goodbye to Salesforce security woes with SpinSPM by @spintechinc! Get ahead of threats with automated tools, complete config visibility, and seamless management. Dive in   #cybersecurity",
        "likes": 55,
        "replies": 3,
        "retweets": 3
    },
    "tweet_75": {
        "text": "\"Tesla publishes its first-ever diversity report revealing Black employees are 10% of the workforce and 4% of leadership...\"via: @CNBC ",
        "likes": 3,
        "replies": 1,
        "retweets": 5
    },
    "tweet_76": {
        "text": "Yes, your name means \"Leader\" in Martian.There is also a currency of M.U.S.K. (Martian Universal Solar Karat) and it's value always mimics the Tesla stock.#ElonvonMars #Leader #Mars ",
        "likes": 9,
        "replies": 0,
        "retweets": 1
    },
    "tweet_77": {
        "text": "One of the most amazing things I've ever seen is how well the traffic flows at major intersections in cities like Mumbai and Delhi.To a westerner, looks like utter chaos ... but it somehow works.",
        "likes": 2,
        "replies": 3,
        "retweets": 2
    },
    "tweet_78": {
        "text": "\"We are entering a golden age for EVs\". Dan Ives from Wedbush Securities speaks with @adsteel . Tesla’s target of delivering 500,000 cars this year is possible with strong 4Q delivery figures, Credit Suisse and Wedbush said in separate notes this week ",
        "likes": 5,
        "replies": 0,
        "retweets": 1
    },
    "tweet_79": {
        "text": "We'll unlock your inner fictional character, showing some hidden talents, traits, and ambitions you might not have even known were there!",
        "likes": 67,
        "replies": 24,
        "retweets": 30
    },
    "tweet_80": {
        "text": "I wish every FSD beta tester had the exact same camera set up!FIRST IMPRESSIONS TESLA FSDBETA 9 2020.48.26.1  via @YouTube",
        "likes": 4,
        "replies": 0,
        "retweets": 1
    },
    "tweet_81": {
        "text": "High time we got our fairytale, I agree.",
        "likes": 15,
        "replies": 1,
        "retweets": 0
    },
    "tweet_82": {
        "text": "Absolutely NO Tesla’s for CPD.",
        "likes": 7,
        "replies": 0,
        "retweets": 0
    },
    "tweet_83": {
        "text": "(this will be our last post regarding the PWS/external speakers until there's another update from Tesla or Elon allowing for retrofits to continue!) ",
        "likes": 17,
        "replies": 0,
        "retweets": 2
    },
    "tweet_84": {
        "text": "Tesla’s car horns can now fart, bark, or do whatever else you want  — via @drivingdotca#Tesla",
        "likes": 12,
        "replies": 14,
        "retweets": 5
    },
    "tweet_85": {
        "text": "Honorable mentions: Ori & The Will of the Wisps, @RocketArena, @DOOM Eternal, @Atomicrops, @HyperScapeGame, HyperDot, @roundguardgame, @NeonAbyssGame, Swimsanity, Dirt 5, @ForegoneGame, @undermine_game, Tesla Force and more! So many great @ID_Xbox & retail games! ",
        "likes": 7,
        "replies": 0,
        "retweets": 1
    },
    "tweet_86": {
        "text": "Very rare clip of Trevor being honest about Nikola",
        "likes": 6,
        "replies": 1,
        "retweets": 0
    },
    "tweet_87": {
        "text": "I guess there’s two types of people in this world. There’s people who enjoy making noises with Tesla Boombox",
        "likes": 8,
        "replies": 1,
        "retweets": 0
    },
    "tweet_88": {
        "text": "Tesla makes real things and will change the world for the better. Bitcoin is a construct. Bitcoin like gold and other currencies is a store of wealth but does nothing to create wealth - unless you are a Bitcoin miner.",
        "likes": 4,
        "replies": 0,
        "retweets": 0
    },
    "tweet_89": {
        "text": "Sci-fi Merc: @Mercedes AMG CLA combines Tesla Autopilot features w Cadillac Augmented Reality in MBUX self-driving upgrade. Cool. Doesn't work in snow, though. Oakland Co, MI @DetroitNews",
        "likes": 2,
        "replies": 0,
        "retweets": 1
    },
    "tweet_90": {
        "text": "I feel about Peloton now the way I felt about Tesla five years ago - loved the product but didn’t understand the valuation. That is to say I probably need to dive into $PTON more.",
        "likes": 7,
        "replies": 0,
        "retweets": 0
    },
    "tweet_91": {
        "text": "sounds like Tesla the last few years and Apple post iPod.  Human beings just don't understand exponential math. Nothing is guaranteed but the supply/demand equation right now is clear.",
        "likes": 14,
        "replies": 0,
        "retweets": 1
    },
    "tweet_92": {
        "text": "A new set of Japanese banknotes featuring famous Japanese people and national icons will go into circulation from July 2024.",
        "likes": 1700,
        "replies": 63,
        "retweets": 152
    },
    "tweet_93": {
        "text": "Tesla's FSD autopilot is smart enough to fold in the mirrors before squeezing past a tow truck.  Kim is not driving in this video, she is \"supervising\" ",
        "likes": 6,
        "replies": 1,
        "retweets": 1
    },
    "tweet_94": {
        "text": "Boy i tweeted something -ve 2 years ago about George glassier at $2 on western.The hate i got then was less visceral than saying anything -ve on UUUU - the best someone told me recently is that its “Tesla of U”. LOL. Funny thing most contrarians who own U wouldn’t touch Tsla",
        "likes": 4,
        "replies": 2,
        "retweets": 0
    },
    "tweet_95": {
        "text": "Nikola cheerleaders keep taking Nikola at its word when it has been proven that Nikola lies a lotNikola: It would cost $200 million to adapt blablablaCheerleader: Proof of why Nikola dumped Republic Services",
        "likes": 6,
        "replies": 1,
        "retweets": 0
    },
    "tweet_96": {
        "text": "I fell deeply, madly in love for the first time in years.Got an apartment with amazing views in a great town.A few investments paid off. Finally bought a Tesla (yes, these two things are related as I put down a deposit four years ago )",
        "likes": 7,
        "replies": 0,
        "retweets": 0
    },
    "tweet_97": {
        "text": "\"My friends think I'm a crypto genius, (I'm not) it's because I read WAGMI’s weekly newsletter (and they have no idea it exists)\" - Every Crypto Degen",
        "likes": 1200,
        "replies": 74,
        "retweets": 58
    }
}